using System;
using System.Collections.Generic;
using System.Configuration;
using System.Linq;
using System.Xml.Linq;

namespace Utility.存储
{
    public static class H测试配置
    {
        static readonly XElement _Doc = null;

        static H测试配置()
        {
            var __路径 = H路径.获取绝对路径(H程序配置.获取字符串("测试配置"));
            _Doc = XElement.Load(__路径);
        }

        public static string 获取字符串(string 用例名, string 参数名)
        {
            var temp = _Doc.Elements(用例名).Elements(参数名).First().Value;
            return temp; 
        }

        public static bool 获取Bool值(string 用例名, string 参数名)
        {
            var __字符串 = 获取字符串(用例名, 参数名);
            bool temp;
            bool.TryParse(__字符串, out temp);
            return temp;
        }

        public static int 获取Int32值(string 用例名, string 参数名)
        {
            var __字符串 = 获取字符串(用例名, 参数名);
            int temp;
            int.TryParse(__字符串, out temp);
            return temp;
        }

    }
}



//<?xml version='1.0' encoding='utf-8' ?>
//<测试配置>
//  <I呼出>
//    <单呼_呼通_调度台挂机_号码1>60000</单呼_呼通_调度台挂机_号码1>
//    <单呼_呼通_调度台挂机_号码2>60001</单呼_呼通_调度台挂机_号码2>
//    <单呼_呼通_对方挂机_号码>60002</单呼_呼通_对方挂机_号码>
//    <组呼_呼通_号码>60100</组呼_呼通_号码>
//    <单呼_异常_空号_号码>61000</单呼_异常_空号_号码>
//    <单呼_异常_关机_号码>61001</单呼_异常_关机_号码>
//    <单呼_异常_对方忙_号码>61002</单呼_异常_对方忙_号码>
//    <单呼_异常_无人接听_号码>61003</单呼_异常_无人接听_号码>
//    <单呼_异常_拒接_号码>61004</单呼_异常_拒接_号码>
//    <单呼_异常_系统忙_号码>61005</单呼_异常_系统忙_号码>
//    <单呼_异常_内部错误_号码>61006</单呼_异常_内部错误_号码>
//    <单呼_异常_超时_号码>61007</单呼_异常_超时_号码>
//    <起呼到失败间隔毫秒数>1000</起呼到失败间隔毫秒数>
//    <起呼到振铃间隔毫秒数>1000</起呼到振铃间隔毫秒数>
//    <振铃到振铃超时间隔毫秒数>5000</振铃到振铃超时间隔毫秒数>
//    <振铃到对方挂机间隔毫秒数>5000</振铃到对方挂机间隔毫秒数>
//    <振铃到摘机间隔毫秒数>2000</振铃到摘机间隔毫秒数>
//    <摘机到对方挂机间隔毫秒数>5000</摘机到对方挂机间隔毫秒数>
//    <呼叫超时毫秒数>10000</呼叫超时毫秒数>
//    <呼叫释放毫秒数>1000</呼叫释放毫秒数>
//    <摘机到调度台挂机间隔毫秒数>5000</摘机到调度台挂机间隔毫秒数>
//    <PTT操作间隔毫秒数>1000</PTT操作间隔毫秒数>
//  </I呼出>
//  <I扩展呼出>
//    <环境侦听_呼通_号码>70000</环境侦听_呼通_号码>
//    <环境侦听_异常_对方已经被监听_号码>71000</环境侦听_异常_对方已经被监听_号码>
//    <基站全呼_呼通_号码>16777212</基站全呼_呼通_号码>
//    <本地全呼_呼通_号码>16777213</本地全呼_呼通_号码>
//    <广播_呼通_号码>70200</广播_呼通_号码>
//    <呼转_呼通_号码>70300</呼转_呼通_号码>
//    <监听_成功_号码>r1</监听_成功_号码>
//    <监听_失败_号码>70401</监听_失败_号码>
//    <起呼到失败间隔毫秒数>1000</起呼到失败间隔毫秒数>
//    <起呼到振铃间隔毫秒数>1000</起呼到振铃间隔毫秒数>
//    <振铃到振铃超时间隔毫秒数>5000</振铃到振铃超时间隔毫秒数>
//    <振铃到对方挂机间隔毫秒数>5000</振铃到对方挂机间隔毫秒数>
//    <振铃到摘机间隔毫秒数>2000</振铃到摘机间隔毫秒数>
//    <摘机到对方挂机间隔毫秒数>5000</摘机到对方挂机间隔毫秒数>
//    <呼叫超时毫秒数>10000</呼叫超时毫秒数>
//    <呼叫释放毫秒数>1000</呼叫释放毫秒数>
//    <摘机到调度台挂机间隔毫秒数>5000</摘机到调度台挂机间隔毫秒数>
//    <PTT操作间隔毫秒数>1000</PTT操作间隔毫秒数>
//  </I扩展呼出>

//</测试配置>